 gcc -g p3final.c
 ./a.out
enter n  value 
5
enter r valur
4
the ncr value is 5 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x879: file p3final.c, line 30.
(gdb) l
16      }
17      return v;
18  }
19  int ncr(int n,int r)
20  {
21      int x;
22      x=factorial(n)/(factorial(r)*factorial(n-r));
 pwd
/home/runner/Test3Session2-3
 gcc -g  p3final.c
 ./a.out
enter n  value 
3
enter r valur
3
the ncr value is 1 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x879: file p3final.c, line 30.
(gdb) l
16      }
17      return v;
18  }
19  int ncr(int n,int r)
20  {
21      int x;
22      x=factorial(n)/(factorial(r)*factorial(n-r));
23      return x;
24  }
25  void output(int n,int r,int x)
(gdb) r
Starting program: /home/runner/Test3Session2-3/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3final.c:30
30  {
(gdb) n
32      input(&n,&r);
(gdb) s
input (n=0x7ffe93bda73c, r=0x7ffe93bda740) at p3final.c:4
4       printf("enter n  value \n");
(gdb) p
The history is empty.
(gdb) c
Continuing.
enter n  value 
f
enter r valur

Program received signal SIGFPE, Arithmetic exception.
0x000055f1f9400836 in ncr (n=22001, r=-1816287184) at p3final.c:22
22      x=factorial(n)/(factorial(r)*factorial(n-r));
(gdb) Quit
(gdb) 
